package ge.edu.sangu;

public class KeyboardLayouts {
    public static final String[][] QWERTY_ANSI = {
        {"1","2","3","4","5","6","7","8","9","0","-","="},
        {"Q","W","E","R","T","Y","U","I","O","P","[","]", "\\"},
        {"A","S","D","F","G","H","J","K","L",";","'"},
        {"Z","X","C","V","B","N","M",",",".","/"}
    };

    public static final String[][] COLEMAK_ANSI = {
        {"1","2","3","4","5","6","7","8","9","0","-","="},
        {"Q","W","F","P","G","J","L","U","Y",":","[","]"},
        {"A","R","S","T","D","H","N","E","I","O","'"},
        {"Z","X","C","V","B","K","M",",",".","/"}
    };

    // Cyrilic
    public static final String[][] MANZHARA_ISO = {
        {"1","2","3","4","5","6","7","8","9","0","-","="},
        {"Є","Я","У","К","Е","Н","Г","С","Т","Ж","Х","Й"},
        {"Б","І","В","А","И","Р","О","Л","Д","З","Ю","Ф"},
        {"Ґ","Щ","Ч","Ц","М","Ш","П","Ь",",",".","Ї"}
    };

    public static final String[][] STANDART_UA_ISO = {
        {"1","2","3","4","5","6","7","8","9","0","-","="},
        {"Й","Ц","У","К","Е","Н","Г","Ш","Щ","З","Х","Ї"},
        {"Ф","І","В","А","П","Р","О","Л","Д","Ж","Є","Ґ"},
        {"Ґ","Я","Ч","С","М","И","Т","Ь","Б","Ю","."}
    };

    public static final String[][] STANDART_UA_ANSI = {
        {"1","2","3","4","5","6","7","8","9","0","-","="},
        {"Й","Ц","У","К","Е","Н","Г","Ш","Щ","З","Х","Ї","Ґ"},
        {"Ф","І","В","А","П","Р","О","Л","Д","Ж","Є"},
        {"Я","Ч","С","М","И","Т","Ь","Б","Ю","."}
    };
}
